<a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>

출처: https://www.w3resource.com/python-exercises/pandas/index-dataframe.php

In [1]:
import pandas as pd
import numpy as np

# ★ 21. Write a Pandas program to iterate over rows in a DataFrame.  

Sample Python dictionary data and list labels:    

```
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]    

Expected Output:    
Anastasia 12.5    
Dima 9.0    
Katherine 16.5    
```

In [2]:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]
df = pd.DataFrame(exam_data)
for index, row in df.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

# 22. Write a Pandas program to get list from DataFrame column headers.     

Sample Python dictionary data and list labels:    

```
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],    
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],    
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],    
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}    
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    

Expected Output:    
['attempts', 'name', 'qualify', 'score']    
```

In [3]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],    
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],    
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],    
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}    
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']  

df = pd.DataFrame(exam_data, index=labels)
sorted(df.columns.tolist())

['attempts', 'name', 'qualify', 'score']

# 23. Write a Pandas program to rename columns of a given DataFrame     

```
Sample data:    
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 9    

New DataFrame after renaming columns:    
Column1 Column2 Column3    
0 1 4 7    
1 2 5 8    
2 3 6 9    
    
```

In [4]:
df = pd.DataFrame(np.swapaxes(np.arange(1,10).reshape(3,3),0,1), columns=['col1','col2','col3'])
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [5]:
df.columns = ['Column1','Column2','Column3']
df

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

# 24. Write a Pandas program to select rows from a given DataFrame based on values in some columns.     

```
Sample data:    
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 4 5 8    
2 3 6 9    
3 4 7 0    
4 5 8 1    

Rows for colum1 value == 4    
col1 col2 col3    
1 4 5 8    
3 4 7 0    
```

In [6]:
array1 = np.random.randint(1, 10 , 15).reshape(5,3)
df  = pd.DataFrame(array1, columns=['col1', 'col2', 'col3'])
df

   col1  col2  col3
0     1     7     4
1     2     2     5
2     6     8     9
3     3     6     4
4     4     5     6

In [7]:
df[df['col1']==4]

   col1  col2  col3
4     4     5     6

# 25. Write a Pandas program to change the order of a DataFrame columns.     

Sample data:    

```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 4 5 8    
2 3 6 9    
3 4 7 0    
4 5 8 1    

After altering col1 and col3    
col3 col2 col1    
0 7 4 1    
1 8 5 4    
2 9 6 3    
3 0 7 4    
4 1 8 5    
```

In [8]:
array1 = np.random.randint(1, 10 , 15).reshape(5,3)
df  = pd.DataFrame(array1, columns=['col1', 'col2', 'col3'])
df

   col1  col2  col3
0     9     7     1
1     5     5     6
2     6     8     5
3     1     5     8
4     2     8     8

In [9]:
df = df[['col3','col2','col1']]
df

   col3  col2  col1
0     1     7     9
1     6     5     5
2     5     8     6
3     8     5     1
4     8     8     2

# 26. Write a Pandas program to add one row in an existing DataFrame.  

```
Sample data:    

Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 4 5 8    
2 3 6 9    
3 4 7 0    
4 5 8 1    

After add one row:    
col1 col2 col3    
0 1 4 7    
1 4 5 8    
2 3 6 9    
3 4 7 0    
4 5 8 1    
5 10 11 12   
```

In [10]:
df = pd.DataFrame(np.random.randint(1, 10, 15, dtype=np.int).reshape(5,3), columns=['col1','col2','col3'])
df

<ipython-input-10-abdde9e2381f>:1: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df = pd.DataFrame(np.random.randint(1, 10, 15, dtype=np.int).reshape(5,3), columns=['col1','col2','col3'])

   col1  col2  col3
0     3     8     1
1     7     2     9
2     6     7     1
3     9     6     6
4     9     9     7

In [11]:
df.loc[5,:]=[10, 11, 12]
df.astype(np.int)

<ipython-input-11-412a39dbd330>:2: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df.astype(np.int)

   col1  col2  col3
0     3     8     1
1     7     2     9
2     6     7     1
3     9     6     6
4     9     9     7
5    10    11    12

# 27. Write a Pandas program to write a DataFrame to CSV file using tab separator.     

Sample data:    

```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 4 5 8    
2 3 6 9    
3 4 7 0    
4 5 8 1    


Data from new_file.csv file:    
col1	col2	col3    
0 1	4	7    
1 4	5	8    
2 3	6	9    
3 4	7	0    
4 5	8	1    
```

In [12]:
df = pd.DataFrame(np.random.randint(1, 10, 15, dtype=np.int).reshape(5,3), columns=['col1','col2','col3'])
df

<ipython-input-12-abdde9e2381f>:1: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df = pd.DataFrame(np.random.randint(1, 10, 15, dtype=np.int).reshape(5,3), columns=['col1','col2','col3'])

   col1  col2  col3
0     4     3     2
1     5     6     3
2     3     5     6
3     3     8     5
4     2     7     8

In [13]:
df.to_csv('test.csv',sep='\t')

In [14]:
!type test.csv

	col1	col2	col3
0	4	3	2
1	5	6	3
2	3	5	6
3	3	8	5
4	2	7	8

# 28. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).     

Sample data:    

```
city Number of people    
0 California 4    
1 Georgia 2    
2 Los Angeles 4    
```

In [15]:
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})

In [16]:
df1

        name         city
0  Anastasia   California
1       Dima  Los Angeles
2  Katherine   California
3      James   California
4      Emily   California
5    Michael  Los Angeles
6    Matthew  Los Angeles
7      Laura      Georgia
8      Kevin      Georgia
9      Jonas  Los Angeles

In [17]:
g1 = df1.groupby(['city']).count()
g1.columns = ['Number of peo']
g1

             Number of peo
city
California               4
Georgia                  2
Los Angeles              4

다른 풀이

In [18]:
df1.groupby(['city']).size()

city
California     4
Georgia        2
Los Angeles    4
dtype: int64

In [19]:
g1 = df1.groupby(["city"]).size().reset_index(name='Number of people')
print(g1)

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

# 29. Write a Pandas program to delete DataFrame row(s) based on given column value.     

Sample data:    


```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 4 5 8    
2 3 6 9    
3 4 7 0    
4 5 8 1    

New DataFrame    
col1 col2 col3    
0 1 4 7    
2 3 6 9    
3 4 7 0    
4 5 8 1  
```

In [20]:
df = pd.DataFrame(np.random.randint(1, 10, 15, dtype=np.int).reshape(5,3), columns=['col1','col2','col3'])
df

<ipython-input-20-abdde9e2381f>:1: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df = pd.DataFrame(np.random.randint(1, 10, 15, dtype=np.int).reshape(5,3), columns=['col1','col2','col3'])

   col1  col2  col3
0     3     5     2
1     8     1     4
2     8     9     6
3     2     4     8
4     2     5     2

In [21]:
df.drop(1, axis=0)

   col1  col2  col3
0     3     5     2
2     8     9     6
3     2     4     8
4     2     5     2

# 30. Write a Pandas program to widen output display to see more columns.   

```
Sample data:    

Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 4 5 8    
2 3 6 9    
3 4 7 0    
4 5 8 1    
```

In [22]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
print("Original DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

# 31. Write a Pandas program to select a row of series/dataframe by given integer index.   

```
Sample data:    
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 4 5 8    
2 3 6 9    
3 4 7 0    
4 5 8 1    
Index-2: Details    
col1 col2 col3    
2 3 6 9    
```

In [23]:
df = pd.DataFrame(np.random.randint(1, 10, 15, dtype=np.int).reshape(5,3), columns=['col1','col2','col3'])
df

<ipython-input-23-abdde9e2381f>:1: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df = pd.DataFrame(np.random.randint(1, 10, 15, dtype=np.int).reshape(5,3), columns=['col1','col2','col3'])

   col1  col2  col3
0     4     8     6
1     7     6     4
2     5     5     9
3     9     4     6
4     7     3     2

In [24]:
df.iloc[2,:]

col1    5
col2    5
col3    9
Name: 2, dtype: int32

In [25]:
df.iloc[[2]]

   col1  col2  col3
2     5     5     9

In [26]:
df.iloc[[2],[2]]

   col3
2     9

# 32. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.     

Sample data:    

```
Original DataFrame    
attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
2 2 Katherine yes 16.5    
3 3 James no NaN    
4 2 Emily no 9.0    
5 3 Michael yes 20.0    
6 1 Matthew yes 14.5    
7 1 Laura no NaN    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    

New DataFrame replacing all NaN with 0:    
attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
2 2 Katherine yes 16.5    
3 3 James no 0.0    
4 2 Emily no 9.0    
5 3 Michael yes 20.0    
6 1 Matthew yes 14.5    
7 1 Laura no 0.0    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    
```

In [27]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [28]:
df.fillna(0)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

# ★ 33. Write a Pandas program to convert index in a column of the given dataframe.     

```
Sample data:    

Original DataFrame    
attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
2 2 Katherine yes 16.5    
3 3 James no NaN    
4 2 Emily no 9.0    
5 3 Michael yes 20.0    
6 1 Matthew yes 14.5    
7 1 Laura no NaN    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    

After converting index in a column:    
index attempts name qualify score    
0 0 1 Anastasia yes 12.5    
1 1 3 Dima no 9.0    
2 2 2 Katherine yes 16.5    
3 3 3 James no NaN    
4 4 2 Emily no 9.0    
5 5 3 Michael yes 20.0    
6 6 1 Matthew yes 14.5    
7 7 1 Laura no NaN    
8 8 2 Kevin no 8.0    
9 9 1 Jonas yes 19.0    

Hiding index:    
index attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
2 2 Katherine yes 16.5    
3 3 James no NaN    
4 2 Emily no 9.0    
5 3 Michael yes 20.0    
6 1 Matthew yes 14.5    
7 1 Laura no NaN    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    
```

In [29]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

In [30]:
print("Original DataFrame")
df

Original DataFrame

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [31]:
print("\nAfter converting index in a column:")
df.reset_index(level=0, inplace=True)
df

After converting index in a column:

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

In [32]:
print("\nHiding index:")
print(df.to_string(index=False))

Hiding index:
 index       name  score  attempts qualify
     0  Anastasia   12.5         1     yes
     1       Dima    9.0         3      no
     2  Katherine   16.5         2     yes
     3      James    NaN         3      no
     4      Emily    9.0         2      no
     5    Michael   20.0         3     yes
     6    Matthew   14.5         1     yes
     7      Laura    NaN         1      no
     8      Kevin    8.0         2      no
     9      Jonas   19.0         1     yes

# 34. Write a Pandas program to set a given value for particular cell in  DataFrame using index value.   

```
Sample data:    

Original DataFrame    
attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
2 2 Katherine yes 16.5    
3 3 James no NaN    
4 2 Emily no 9.0    
5 3 Michael yes 20.0    
6 1 Matthew yes 14.5    
7 1 Laura no NaN    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    

Set a given value for particular cell in the DataFrame    
attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
2 2 Katherine yes 16.5    
3 3 James no NaN    
4 2 Emily no 9.0    
5 3 Michael yes 20.0    
6 1 Matthew yes 14.5    
7 1 Laura no NaN    
8 2 Kevin no 10.2    
9 1 Jonas yes 19.0   
```

In [33]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [34]:
df[df.index==3] = ['A',np.NaN, 3, 'nope']
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3          A    NaN         3    nope
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

# 35. Write a Pandas program to count the NaN values in one or more columns in DataFrame.     

```
Sample data:    

Original DataFrame    
attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
2 2 Katherine yes 16.5    
3 3 James no NaN    
4 2 Emily no 9.0    
5 3 Michael yes 20.0    
6 1 Matthew yes 14.5    
7 1 Laura no NaN    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    

Number of NaN values in one or more columns:    
2    
```

In [35]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [36]:
df.isna().sum()

name        0
score       2
attempts    0
qualify     0
dtype: int64

In [37]:
df.isna().sum(axis=1)

0    0
1    0
2    0
3    1
4    0
5    0
6    0
7    1
8    0
9    0
dtype: int64

In [38]:
df.isnull().values.sum()

2

# 36. Write a Pandas program to drop a list of rows from a specified DataFrame.     

```
Sample data:   

Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 4 5 8    
2 3 6 9    
3 4 7 0    
4 5 8 1    

New DataFrame after removing 2nd & 4th rows:    
col1 col2 col3    
0 1 4 7    
1 4 5 8    
3 4 7 0    
```

In [39]:
df = pd.DataFrame((np.arange(1,16).reshape(5,3)), columns=['col1','col2','col3'])
df

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9
3    10    11    12
4    13    14    15

In [40]:
# 2, 4 index를 지워라
df.loc[[0,1,3]]

   col1  col2  col3
0     1     2     3
1     4     5     6
3    10    11    12

In [41]:
df = df.drop(df.index[[2,4]])
print(df)

   col1  col2  col3
0     1     2     3
1     4     5     6
3    10    11    12

In [42]:
df.index[[0,1]]

Int64Index([0, 1], dtype='int64')

# 37. Write a Pandas program to reset index in a given DataFrame.   

```
Sample data:    

Original DataFrame    

attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
2 2 Katherine yes 16.5    
3 3 James no NaN    
4 2 Emily no 9.0    
5 3 Michael yes 20.0    
6 1 Matthew yes 14.5    
7 1 Laura no NaN    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    

After removing first and second rows    

attempts name qualify score    
2 2 Katherine yes 16.5    
3 3 James no NaN    
4 2 Emily no 9.0    
5 3 Michael yes 20.0    
6 1 Matthew yes 14.5    
7 1 Laura no NaN    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    

Reset the Index:    

index attempts name qualify score    
0 2 2 Katherine yes 16.5    
1 3 3 James no NaN    
2 4 2 Emily no 9.0    
3 5 3 Michael yes 20.0    
4 6 1 Matthew yes 14.5    
5 7 1 Laura no NaN    
6 8 2 Kevin no 8.0    
7 9 1 Jonas yes 19.0    
```

In [43]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [44]:
df.drop(df.index[[0,1]], inplace=True)

In [45]:
df

        name  score  attempts qualify
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [46]:
df.reset_index(inplace=True)
df

   index       name  score  attempts qualify
0      2  Katherine   16.5         2     yes
1      3      James    NaN         3      no
2      4      Emily    9.0         2      no
3      5    Michael   20.0         3     yes
4      6    Matthew   14.5         1     yes
5      7      Laura    NaN         1      no
6      8      Kevin    8.0         2      no
7      9      Jonas   19.0         1     yes

# 38. Write a Pandas program to divide a DataFrame in a given ratio.    

```
Sample data:    

Original DataFrame:    
0 1    
0 0.316147 -0.767359    
1 -0.813410 -2.522672    
2 0.869615 1.194704    
3 -0.892915 -0.055133    
4 -0.341126 0.518266    
5 1.857342 1.361229    
6 -0.044353 -1.205002    
7 -0.726346 -0.535147    
8 -1.350726 0.563117    
9 1.051666 -0.441533    

70% of the said DataFrame:    
0 1    
8 -1.350726 0.563117    
2 0.869615 1.194704    
5 1.857342 1.361229    
6 -0.044353 -1.205002    
3 -0.892915 -0.055133    
1 -0.813410 -2.522672    
0 0.316147 -0.767359    

30% of the said DataFrame:    
0 1    
4 -0.341126 0.518266    
7 -0.726346 -0.535147    
9 1.051666 -0.441533    
```

In [47]:
df.sample()

   index   name  score  attempts qualify
7      9  Jonas   19.0         1     yes

In [48]:
df = pd.DataFrame(np.random.randn(10, 2))
print("Original DataFrame:")
print(df)
part_70 = df.sample(frac=0.7,random_state=10)
part_30 = df.drop(part_70.index)
print("\n70% of the said DataFrame:")
print(part_70)
print("\n30% of the said DataFrame:")
print(part_30)

Original DataFrame:
          0         1
0 -0.262131 -2.259122
1  1.216571  1.947956
2 -0.232050 -0.613678
3  1.095844  0.713639
4 -0.105083  0.662183
5  0.477272  1.301234
6  1.999208  0.242737
7  0.711655 -0.557560
8 -0.499179 -0.315811
9 -0.312335 -0.188031

70% of the said DataFrame:
          0         1
8 -0.499179 -0.315811
2 -0.232050 -0.613678
5  0.477272  1.301234
6  1.999208  0.242737
3  1.095844  0.713639
1  1.216571  1.947956
0 -0.262131 -2.259122

30% of the said DataFrame:
          0         1
4 -0.105083  0.662183
7  0.711655 -0.557560
9 -0.312335 -0.188031

# 39. Write a Pandas program to combining two series into a DataFrame.     

```
Sample data:    

Data Series:    
0 100    
1 200    
2 python    
3 300.12    
4 400    
dtype: object    

0 10    
1 20    
2 php    
3 30.12    
4 40    
dtype: object    

New DataFrame combining two series:    
0 1    
0 100 10    
1 200 20    
2 python php    
3 300.12 30.12    
4 400 40    
```

In [49]:
s1 = pd.Series([100, 200, 'python', 300.12, 400])
s2 = pd.Series([10, 20, 'php', 3012, 40])
s1, s2

(0       100
 1       200
 2    python
 3    300.12
 4       400
 dtype: object,
 0      10
 1      20
 2     php
 3    3012
 4      40
 dtype: object)

In [51]:
pd.DataFrame({0:s1, 1:s2})

        0     1
0     100    10
1     200    20
2  python   php
3  300.12  3012
4     400    40

# ★ 40. Write a Pandas program to shuffle a given DataFrame rows.  

```
Sample data:    

Original DataFrame:    
attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
2 2 Katherine yes 16.5    
3 3 James no NaN    
4 2 Emily no 9.0    
5 3 Michael yes 20.0    
6 1 Matthew yes 14.5    
7 1 Laura no NaN    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    

New DataFrame:    
attempts name qualify score    
5 3 Michael yes 20.0    
0 1 Anastasia yes 12.5    
9 1 Jonas yes 19.0    
6 1 Matthew yes 14.5    
7 1 Laura no NaN    
1 3 Dima no 9.0    
3 3 James no NaN    
4 2 Emily no 9.0    
8 2 Kevin no 8.0    
2 2 Katherine yes 16.5    
```

In [61]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [62]:
new_idx = np.random.choice(df.index, df.shape[0])
new_idx

array([8, 9, 6, 4, 9, 1, 9, 6, 0, 3], dtype=int64)

In [63]:
df.iloc[new_idx]

        name  score  attempts qualify
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes
6    Matthew   14.5         1     yes
4      Emily    9.0         2      no
9      Jonas   19.0         1     yes
1       Dima    9.0         3      no
9      Jonas   19.0         1     yes
6    Matthew   14.5         1     yes
0  Anastasia   12.5         1     yes
3      James    NaN         3      no

다른 정답

In [67]:
df.sample(frac=1)

        name  score  attempts qualify
2  Katherine   16.5         2     yes
5    Michael   20.0         3     yes
1       Dima    9.0         3      no
0  Anastasia   12.5         1     yes
7      Laura    NaN         1      no
4      Emily    9.0         2      no
9      Jonas   19.0         1     yes
6    Matthew   14.5         1     yes
3      James    NaN         3      no
8      Kevin    8.0         2      no